Repository: alwisiebers/dsmr-reader
Catalog: docs/locale/*/LC_MESSAGES/notifications.po
Languages: nl

source: Integration: Notifications
nl: Integratie: Notificaties

source: Usage notification: Daily usage statistics on your smartphone
nl: Verbruiksnotificaties: Dagelijkse verbruiksstatistieken op je smartphone

source: *Which services for sending notifications are supported?*
nl: *Welke services voor het sturen van notificaties worden ondersteund?*

source: Currently, two mobile platforms are supported: Android and iOS. The supported app for Android is `NotifyMyAndroid <https://www.notifymyandroid.com>`_. The supported app for iOS is `Prowl <https://www.prowlapp.com>`_.
nl: Op dit moment worden twee platforms ondersteund: Android en iOS. De ondersteunde app voor Android is `NotifyMyAndroid <https://www.notifymyandroid.com>`_. De ondersteunde app voor iOS is `Prowl <https://www.prowlapp.com>`_.

source: *How do I setup usage notifications?*
nl: *Hoe stel ik verbruiksnotificaties in?*

source: Make sure you either have NotifyMyAndroid or Prowl installed on your smartphone. If you don't, visit your platforms app store to download the app and sign up for an account. Then, make sure to get your API key from the notificationservice that you prefer. For instruction on obtaining the API key, please read below.
nl: Zorg ervoor dat je NotifyMyAndroid of Prowl hebt geïnstalleerd op je smartphone. Als dat niet het geval is, bezoek dan de app store van je platform, download de gewenste app en maak daarvoor een account. Daarna haal je de API key voor de notificatieservice die je wilt gebruiken op. Om te lezen hoe dat werkt, lees dan de instructies bij de volgende kopjes.

source: In the DSMR-reader settings for the Usagenotifications, tick the Send Notifications checkbox and select the notification service you want to use. Then copy the API key from the notification service and paste in into the the textbox for the API key. When you save these settings, your first notification should be sent after midnight. Don't worry, the notification will be sent with low priority and will not wake you up.
nl: In de DSMR-reader instellingen voor de Verbruiksnotificaties zet je een vinkje bij Stuur Notificaties en selecteer daaronder welke notificatieservice je wilt gebruiken. Kopieeër daarna de API key van de notificatieservice en plak deze in het tekstveld voor de API key. Als je deze instellingen opslaat zul je na middernacht je eerste notificatie ontvangen. Geen nood, de notificatie wordt altijd verstuurd met lage prioriteit, deze maakt je dus niet wakker.

source: *How do I obtain my API key for NotifyMyAndroid?*
nl: *Hoe haal ik de API key op voor NotifyMyAndroid?*

source: After you have downloaded NotifyMyAndroid and signed up for an account you should be able to `login to your NotifyMyAndroid account <https://www.notifymyandroid.com/index.jsp>`_. Now go to "`My Account <https://www.notifymyandroid.com/account.jsp>`_", you should see an overview of your current API keys if you have any. To create an API key for the DSMR-reader, please click **"Generate New Key"**.
nl: Nadat je NotifyMyAndroid hebt gedownload en een account hebt aangemaakt zou je moeten kunnen `inloggen op je NotifyMyAndroid-account <https://www.notifymyandroid.com/index.jsp>`_. Ga nu naar "`My Account <https://www.notifymyandroid.com/account.jsp>`_" om een overzicht van je account de API keys te krijgen als je deze al hebt. Om een API key voor de DSMR-reader te genereren klik je op **"Generate New Key"**.

source: When a new key is generated, you will see it immediatly. Your key is listed like in the screenshot below (the red box marks your API key).
nl: Als er een nieuwe key is gegenereerd, zie je deze direct. De key is te vinden zoals in onderstaande screenshot (er staat een rood kader om de key).

source: *How do I obtain my API key for Prowl?*
nl: *Hoe haal ik de API key op voor Prowl?*

source: After you have downloaded Prowl and signed up for an account you should be able to `login to your Prowl account <https://www.prowlapp.com/login.php>`_. Now go to "`API Keys <https://www.prowlapp.com/api_settings.php>`_", you should see an overview of your current API keys if you have any. To create an API key for the DSMR-reader, input a name and click **"Generate Key"**.
nl: Nadat je Prowl hebt gedownload en een account hebt aangemaakt zou je moeten kunnen `inloggen op je Prowl-account <https://www.prowlapp.com/login.php>`_. Ga nu naar "`API Keys <https://www.prowlapp.com/api_settings.php>`_" om een overzicht van je API keys te krijgen als je deze al hebt. Om een API key voor de DSMR-reader te genereren geef je een naam op en klik je op **"Generate Key"**.
